app/controllers/posts_controller.rb

  def index  # indexアクションを定義した
    @posts = Post.all
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    Post.create(content: params[:content])
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('もう食べました', '2020-08-06 07:32:51.855070', '2020-08-06 07:32:51.855070')

  def checked
    post = Post.find(params[:id])
    if post.checked then
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-08-06 08:30:52.173218' WHERE `posts`.`id` = 2
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2020-08-06 08:30:31.181441' WHERE `posts`.`id` = 2